Revit 2027 API
RailExtensionStyle Enumeration
 The extension style of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailExtensionStyle
Public Enumeration RailExtensionStyle
public enum class RailExtensionStyle
type RailExtensionStyle
Members
Member name | Value | Description
Floor | 2 |  The rail extends to floor.
None | 0 |  The rail extends to nothing
Post | 3 |  The rail extends to post.
Wall | 1 |  The rail extends to wall.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace